carlk3/no-OS-FatFS-SD-SPI-RPi-Pico/src/sd_driver/SDIO/rp2040_sdio.c
            g_sdio.blocks_done++;
            if (g_sdio.blocks_done < g_sdio.total_blocks)
            {
                sdio_start_next_block_tx(sd_card_p);
                g_sdio.transfer_state = SDIO_TX;

                if (g_sdio.blocks_checksumed < g_sdio.total_blocks)
                {
                    // Precompute the CRC for next block so that it is ready when
                    // we want to send it.
                    sdio_compute_next_tx_checksum();
                }
            }
            else
            {
                rp2040_sdio_stop(sd_card_p);
            }
        }    
    }
}

// When a block finishes, this IRQ handler starts the next one
static void rp2040_sdio_tx_irq() {
    sd_card_t *sd_card_p = match_and_clear_irq(DMA_IRQ_0);
    if (!sd_card_p)
        sd_card_p = match_and_clear_irq(DMA_IRQ_1); 
    if (!sd_card_p) // shared interrupt
        return;
    sub_rp2040_sdio_tx_irq(sd_card_p);
}

// Check if transmission is complete
sdio_status_t rp2040_sdio_tx_poll(sd_card_t *sd_card_p, uint32_t *bytes_complete)
{
    if (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk)
    {
        // Verify that IRQ handler gets called even if we are in hardfault handler
        sub_rp2040_sdio_tx_irq(sd_card_p);
    }

    if (bytes_complete)
    {
        *bytes_complete = g_sdio.blocks_done * SDIO_BLOCK_SIZE;
    }

    if (g_sdio.transfer_state == SDIO_IDLE)
    {
        rp2040_sdio_stop(sd_card_p);
        return g_sdio.wr_status;
    }
    // else if ((uint32_t)(millis() - g_sdio.transfer_start_time) > 1000)
    else if ((absolute_time_diff_us(get_absolute_time(), g_sdio.transfer_timeout_time) <= 0))
    {
        azdbg("rp2040_sdio_tx_poll() timeout, "
            "PIO PC: ", (int)pio_sm_get_pc(SDIO_PIO, SDIO_DATA_SM) - (int)g_sdio.pio_data_tx_offset,
            " RXF: ", (int)pio_sm_get_rx_fifo_level(SDIO_PIO, SDIO_DATA_SM),
            " TXF: ", (int)pio_sm_get_tx_fifo_level(SDIO_PIO, SDIO_DATA_SM),
            " DMA CNT: ", dma_hw->ch[SDIO_DMA_CH].al2_transfer_count);
        rp2040_sdio_stop(sd_card_p);
        return SDIO_ERR_DATA_TIMEOUT;
    }

    return SDIO_BUSY;
}

// Force everything to idle state
sdio_status_t rp2040_sdio_stop(sd_card_t *sd_card_p)
{
    dma_channel_abort(SDIO_DMA_CH);
    dma_channel_abort(SDIO_DMA_CHB);
    dma_set_irq1_channel_mask_enabled(1 << SDIO_DMA_CHB, 0);
    pio_sm_set_enabled(SDIO_PIO, SDIO_DATA_SM, false);
    pio_sm_set_consecutive_pindirs(SDIO_PIO, SDIO_DATA_SM, SDIO_D0, 4, false);    
    g_sdio.transfer_state = SDIO_IDLE;
    return SDIO_OK;
}

void rp2040_sdio_init(sd_card_t *sd_card_p, uint16_t clock_divider, uint8_t clock_div_256ths)
{
    // Mark resources as being in use, unless it has been done already.
    static bool resources_claimed = false;
    if (!resources_claimed)
    {
        if (!SDIO_PIO)
            SDIO_PIO = pio0;
        // pio_sm_claim(SDIO_PIO, SDIO_CMD_SM);
        // int pio_claim_unused_sm(PIO pio, bool required);
        SDIO_CMD_SM = pio_claim_unused_sm(SDIO_PIO, true);        
        // pio_sm_claim(SDIO_PIO, SDIO_DATA_SM);
        SDIO_DATA_SM = pio_claim_unused_sm(SDIO_PIO, true);
        // dma_channel_claim(SDIO_DMA_CH);
        SDIO_DMA_CH = dma_claim_unused_channel(true);
        // dma_channel_claim(SDIO_DMA_CHB);
        SDIO_DMA_CHB = dma_claim_unused_channel(true);

        // Set up IRQ handler when DMA completes.
        if (!sd_card_p->sdio_if.DMA_IRQ_num)
            sd_card_p->sdio_if.DMA_IRQ_num = DMA_IRQ_0;
        sd_card_p = sd_card_p;
        irq_add_shared_handler(
            sd_card_p->sdio_if.DMA_IRQ_num, rp2040_sdio_tx_irq,
            PICO_SHARED_IRQ_HANDLER_DEFAULT_ORDER_PRIORITY);

        resources_claimed = true;
    }

    memset(&g_sdio, 0, sizeof(g_sdio));

    dma_channel_abort(SDIO_DMA_CH);
    dma_channel_abort(SDIO_DMA_CHB);
    pio_sm_set_enabled(SDIO_PIO, SDIO_CMD_SM, false);
    pio_sm_set_enabled(SDIO_PIO, SDIO_DATA_SM, false);

    // Load PIO programs
    pio_clear_instruction_memory(SDIO_PIO);

    // Command & clock state machine
    g_sdio.pio_cmd_clk_offset = pio_add_program(SDIO_PIO, &sdio_cmd_clk_program);
    pio_sm_config cfg = sdio_cmd_clk_program_get_default_config(g_sdio.pio_cmd_clk_offset);
    sm_config_set_out_pins(&cfg, SDIO_CMD, 1);
    sm_config_set_in_pins(&cfg, SDIO_CMD);
    sm_config_set_set_pins(&cfg, SDIO_CMD, 1);
    sm_config_set_jmp_pin(&cfg, SDIO_CMD);
    sm_config_set_sideset_pins(&cfg, SDIO_CLK);
    sm_config_set_out_shift(&cfg, false, true, 32);
    sm_config_set_in_shift(&cfg, false, true, 32);
    sm_config_set_clkdiv_int_frac(&cfg, clock_divider, clock_div_256ths);
    sm_config_set_mov_status(&cfg, STATUS_TX_LESSTHAN, 2);

    pio_sm_init(SDIO_PIO, SDIO_CMD_SM, g_sdio.pio_cmd_clk_offset, &cfg);
    pio_sm_set_consecutive_pindirs(SDIO_PIO, SDIO_CMD_SM, SDIO_CLK, 1, true);
    pio_sm_set_enabled(SDIO_PIO, SDIO_CMD_SM, true);

    // Data reception program
    g_sdio.pio_data_rx_offset = pio_add_program(SDIO_PIO, &sdio_data_rx_program);
    g_sdio.pio_cfg_data_rx = sdio_data_rx_program_get_default_config(g_sdio.pio_data_rx_offset);
    sm_config_set_in_pins(&g_sdio.pio_cfg_data_rx, SDIO_D0);
    sm_config_set_in_shift(&g_sdio.pio_cfg_data_rx, false, true, 32);
    sm_config_set_out_shift(&g_sdio.pio_cfg_data_rx, false, true, 32);
    sm_config_set_clkdiv_int_frac(&g_sdio.pio_cfg_data_rx, clock_divider, clock_div_256ths);

    // Data transmission program
    g_sdio.pio_data_tx_offset = pio_add_program(SDIO_PIO, &sdio_data_tx_program);
    g_sdio.pio_cfg_data_tx = sdio_data_tx_program_get_default_config(g_sdio.pio_data_tx_offset);
    sm_config_set_in_pins(&g_sdio.pio_cfg_data_tx, SDIO_D0);
    sm_config_set_set_pins(&g_sdio.pio_cfg_data_tx, SDIO_D0, 4);
    sm_config_set_out_pins(&g_sdio.pio_cfg_data_tx, SDIO_D0, 4);
    sm_config_set_in_shift(&g_sdio.pio_cfg_data_tx, false, false, 32);
    sm_config_set_out_shift(&g_sdio.pio_cfg_data_tx, false, true, 32);
    sm_config_set_clkdiv_int_frac(&g_sdio.pio_cfg_data_tx, clock_divider, clock_div_256ths);

    // Disable SDIO pins input synchronizer.
    // This reduces input delay.
    // Because the CLK is driven synchronously to CPU clock,
    // there should be no metastability problems.
    SDIO_PIO->input_sync_bypass |= (1 << SDIO_CLK) | (1 << SDIO_CMD)
                                 | (1 << SDIO_D0) | (1 << SDIO_D1) | (1 << SDIO_D2) | (1 << SDIO_D3);

    // Redirect GPIOs to PIO
    gpio_set_function(SDIO_CMD, GPIO_FUNC_PIO1);
    gpio_set_function(SDIO_CLK, GPIO_FUNC_PIO1);
    gpio_set_function(SDIO_D0, GPIO_FUNC_PIO1);
    gpio_set_function(SDIO_D1, GPIO_FUNC_PIO1);
    gpio_set_function(SDIO_D2, GPIO_FUNC_PIO1);
    gpio_set_function(SDIO_D3, GPIO_FUNC_PIO1);

    irq_set_enabled(sd_card_p->sdio_if.DMA_IRQ_num, true);
}
